import java.util.HashSet;

public interface IHuman extends IFairyTaleObject{
	//TODO: когда человек осматривается, он запоминает объекты в этой локации. И когда он осматривается, в чат выводится, что он мол осмотрелся и увидел + Location.toString()
	
	/**
	 * Метод даёт ответ, является ли человек мужчиной в самом расцвете сил? Карлсон-то точно является
	 * @param human человек для сравнения
	 * @throws IncomparibleAgeException Если у одного из людей возраст неопределён,
	 * то люди считаются несравнимыми, выбрасывается ексепшн, приводится соответствующая информация
	 */
	public void compareAge(IHuman human) throws IncomparibleAgeException;
	
	public IAge getAge();
	
	/**
	 * Метод рассчитывает, является ли этот человек мужчиной в самом расцвете сил
	 * @return true, если является этот человек мужчиной в самом расцвете сил, иначе false
	 */
	public boolean isAManInPrime();
	
	/**
	 * Получаем имя человека
	 * @return имя человека
	 */
	public String getName();
	
	/**
	 * Одеть человека в указанную одежду
	 * @param outfit - костюм, в которой наряжаем человека
	 */
	public void dress(IOutfit outfit);
	
	/**
	 * Снять с человека одежду
	 */
	public void undress();
	
	/**
	 * Метод отвечает за запоминание человеком вещи.
	 * Если пытаемся запомнить себя же, то ничего не происходит.
	 * Если пытаемся запомнить объект, который уже помним - ничего не происходит
	 */
	public void remember(IFairyTaleObject object);
	
	/**
	 * Метод отвечает за забывание человеком вещи
	 */
	public void forget(IFairyTaleObject object);
	
	/**
	 * Метод человека "осмотреться" отвечает за получение информации о той локации,
	 * где он находится, а также запомимание всех объектов в ней находящихся
	 */
	public void lookAround();
	
	/**
	 * Метод реализует детальное рассмотрение объекта.
	 * Человек, который детально рассматривает объект,
	 * заности его в память, получает его текстовое описание и взаимодействует,
	 * то есть получает какие-то эмоции
	 * @param object объект, с которым взаимодействуем
	 */
	public void visuallyAnalize(IFairyTaleObject object);
	
	/**
	 * Метод проверяет, помнит человек заданную вещь или нет
	 * @param object объект, память о котором проверяется
	 * @return true, если помнит, иначе false
	 */
	public boolean isRemembered(IFairyTaleObject object);
	
	/**
	 * Метод продемонстрировать эмоции. После его вызова человек
	 * продемонстрирует ту свою эмоцию, которая наиболее выражена в данный момент.
	 * Например, засмеётся, если радость или закричит, если испуг.
	 */
	public void showEmotion();
	
	/**
	 * Получить ту эмоцию, которая наибоелее выражена в данный момент
	 * @return эмоцию
	 */
	public IEmotion getCurrentEmotion();
	
	/**
	 * Передать человеку this следующие эмоции
	 * @param emotions список эмоций, которые передаются человеку
	 */
	public void affect(HashSet<IEmotion> emotions);
	
}
