import java.util.HashSet;

/**
 * интерфейс взаимодействия с локацией
 * @author Алексей
 *
 */
public interface ILocation {
	
	/**
	 * Метод получает некий текст, который играется каким-то объектом.
	 * К тексту добавляется контекст локации (в простейшем случае это название).
	 * Затем пересылается сцене, где к этому будет добавлено время или что-то такое,
	 * а затем выведено куда надо
	 * @param text текст
	 */
	public void act(String text);
	
	/**
	 * Метод устанавливает соединение локации this с локацией location.
	 * Теперь перемещение из this в location возможно.
	 * Внивание: перемещеине из location в this это никак не регулиует,
	 * то есть все маршруты однонаправленные
	 * @param location локаций, куда разрешаем перемещаться
	 */
	public void connect(ILocation location);
	
	/**
	 * Получить множество объектов в этой локации
	 * @return множество объектов в этой локации
	 */
	public HashSet<IFairyTaleObject> getObjects();
	
	/**
	 * Получить список локаций, куда можно переместиться их этой локации
	 * @return список локаций, куда можно переместиться их этой локации
	 */
	public HashSet<ILocation> getAvailableLocations();
	
	/**
	 * Получить название этой локации
	 * @return строка - название этой локации
	 */
	public String getName();
	
	/**
	 * Метод производит добавление указанного объекта в эту локацию
	 * @param object объект, который нужно добавить в эту локацию
	 */
	public void addObject(IFairyTaleObject object);
	
	/*
	 * Метод узнаёт сцену, в которой задействована эта локация
	 */
	public IScene getScene();
	
}
