/**
 * Ётот класс определ€ет ошибку, возникающую при попытке сравнить 2 возраста,
 * среди которых есть хот€ бы 1 неопределЄнный
 * @author јлексей
 *
 */
public class IncomparibleAgeException extends Exception {

	/**
	 *  онструктор получает имена 2 людей и, обрабатыва€ их нужным образом,
	 * выдаЄт строку с описанием того, кто эти люди
	 * и по какой причине мы не можем их сравнивать
	 * @param human1 первый человек
	 * @param human2 второй человек
	 */
	public IncomparibleAgeException(IHuman human1, IHuman human2) {
		// TODO: ƒобыть информацию о люд€х и вызвать присвоить message строку с отчЄтом, что и почему несравнимо
		super("возраст 1) " + human1.getSceneName()  + " и 2) " + human2.getSceneName() + " сравнить невозможно, потому что возраст первого человека - " + human1.getAge() + ", второго - " + human2.getAge());
	}

}
