/**
 * Этот интерфейс определяет взаимодействия со сценой
 * @author Алексей
 *
 */
public interface IScene {
	/**
	 * Полученый от локации или откуда-либо ещё текст обрабатывается
	 * в соответствии с какой-то логикой (например, добавить время) и выводится на "экран"
	 * Ну или добавляется в специальную текстовую строку
	 * @param text текст
	 */
	public void act(String text);
	
	/**
	 * В этом методе содержится исполняемый сценарий.
	 * Он выполняется, формируется специальная строка - результат работы сценария.
	 * Все действующие объекты и локации запоминаются и упоминаются вначале
	 */
	public void execute();
	
	/**
	 * Метод представляет все локации и действующие лица
	 */
	public void introduce();
	
	/**
	 * Метод подготовки сцены к исполнению.
	 * Обнуляются списки задействованных объектов и локаций.
	 * При каждом добавлении объекта или локации таковый заносятся
	 * в соответствующий список
	 */
	public void prepare();
	
	/**
	 * Метод добавляния объекта к задействованными в сцене
	 */
	public void addObject(IFairyTaleObject object);
	
	/**
	 * Метод добавляния локации к задействованными в сцене
	 */
	public void addLocation(ILocation location);
	
	/**
	 * Узнать имя этой сцены, то есть её название
	 * @return название сцены
	 */
	public String getName();
	
	/**
	 * Добавить заданное в параметре время к объекту времени этой сцены
	 * @param seconds время, указанное в секундах, что будет добавлено
	 */
	public void timePass(int seconds);
	
}
